In [1]:
import pandas as pd

In [28]:
import numpy as np

In [2]:
obj=pd.Series([4,7,-2,1])

In [3]:
obj

0    4
1    7
2   -2
3    1
dtype: int64

In [4]:
obj.values

array([ 4,  7, -2,  1])

In [5]:
obj.index

RangeIndex(start=0, stop=4, step=1)

- You can Also create index manually

In [10]:
obj2=pd.Series([x%3 for x in range(0,4)] ,index=['a','b','c','d'])

In [11]:
obj2

a    0
b    1
c    2
d    0
dtype: int64

In [12]:
obj2.index

Index(['a', 'b', 'c', 'd'], dtype='object')

- selecting values with index

In [13]:
obj2['a']

0

In [15]:
obj2['c']

2

- You can also do filteration on the data

In [22]:
obj2=pd.Series([x/2 for x in range(0,10)], index=[chr(i) for i in range(65,75)])

In [23]:
obj2

A    0.0
B    0.5
C    1.0
D    1.5
E    2.0
F    2.5
G    3.0
H    3.5
I    4.0
J    4.5
dtype: float64

In [26]:
obj2[obj2>2.0]

F    2.5
G    3.0
H    3.5
I    4.0
J    4.5
dtype: float64

In [27]:
obj2*2

A    0.0
B    1.0
C    2.0
D    3.0
E    4.0
F    5.0
G    6.0
H    7.0
I    8.0
J    9.0
dtype: float64

In [29]:
np.exp(obj2) #applying exponential to the whole data series

A     1.000000
B     1.648721
C     2.718282
D     4.481689
E     7.389056
F    12.182494
G    20.085537
H    33.115452
I    54.598150
J    90.017131
dtype: float64

- you can also do validation on the Series

In [30]:
'b' in obj2.index

False

In [31]:
'B' in obj2.index

True

- Creating Series using dictionary

In [54]:
dicts={'Karachi':35000,'Islamabad':71999,'Multan':129478,'PESHAWER':92481}

In [55]:
obj2=pd.Series(dicts)

In [56]:
obj2

Karachi       35000
Islamabad     71999
Multan       129478
PESHAWER      92481
dtype: int64

In [57]:
province=['SINDH','PUNJAB','PUNJAB','KHYBER PAKTUNKHWA']

In [59]:
data=pd.Series(dicts,index=province)
data

SINDH               NaN
PUNJAB              NaN
PUNJAB              NaN
KHYBER PAKTUNKHWA   NaN
dtype: float64

In [60]:
province=['Karachi','Multan','Islamabad','Texas','PESHAWER','ohIO']
data2=pd.Series(dicts,index=province)
#here, it is putting the values of the list accc to the dict keys, and if any key doesn't match from the list
#then that key from the list will be as non
data2

Karachi       35000.0
Multan       129478.0
Islamabad     71999.0
Texas             NaN
PESHAWER      92481.0
ohIO              NaN
dtype: float64

In [62]:
pd.isnull(data2) #returns True or False, if there is any null value or NAN in the Series

Karachi      False
Multan       False
Islamabad    False
Texas         True
PESHAWER     False
ohIO          True
dtype: bool

In [63]:
pd.notnull(data2) #opposite to isnull() method returns True or False, if there is any null value or NAN in the Serie

Karachi       True
Multan        True
Islamabad     True
Texas        False
PESHAWER      True
ohIO         False
dtype: bool

In [64]:
data2.isnull() #same as the isnull() method, but here it is an instance of the Series Data

Karachi      False
Multan       False
Islamabad    False
Texas         True
PESHAWER     False
ohIO          True
dtype: bool

In [68]:
obj2['Hyderabad']=4142
data2,obj2

(Karachi       35000.0
 Multan       129478.0
 Islamabad     71999.0
 Texas             NaN
 PESHAWER      92481.0
 ohIO              NaN
 dtype: float64, Karachi       35000
 Islamabad     71999
 Multan       129478
 PESHAWER      92481
 Hyderabad      4142
 dtype: int64)

- you can also add different data Frames

In [69]:
new_data=data2+obj2

In [71]:
new_data 
#only adds the match indexes within the both Series Data, rest the converted into NaN, whether it is empty or not

Hyderabad         NaN
Islamabad    143998.0
Karachi       70000.0
Multan       258956.0
PESHAWER     184962.0
Texas             NaN
ohIO              NaN
dtype: float64

In [73]:
new_data.name='Population'
new_data.index.name='Province'
#adding the names of the index and it's value.

In [74]:
new_data

Province
Hyderabad         NaN
Islamabad    143998.0
Karachi       70000.0
Multan       258956.0
PESHAWER     184962.0
Texas             NaN
ohIO              NaN
Name: Population, dtype: float64

In [75]:
new_data.name

'Population'

In [76]:
new_data.index.name

'Province'

# DATAFRAMES

A DataFrame represents a rectangular table of data and contains an ordered collec‐
tion of columns, each of which can be a different value type (numeric, string,
boolean, etc.). The DataFrame has both a row and column index; it can be thought of
as a dict of Series all sharing the same index. Under the hood, the data is stored as one
or more two-dimensional blocks rather than a list, dict, or some other collection of
one-dimensional arrays. The exact details of DataFrame’s internals are outside the
scope of this book

In [85]:
np.random.rand(6)

array([0.81158282, 0.82705293, 0.79295342, 0.95663606, 0.25408763,
       0.46629641])

In [98]:
data={'States':['Ohio','Ohio','Ohio','Nevada','Nevada','Nevada',],
      'year':[2000,2001,2002,2000,2001,2002],
      'pop':np.random.rand(6)+1.4}

In [99]:
data

{'States': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
 'year': [2000, 2001, 2002, 2000, 2001, 2002],
 'pop': array([2.32012223, 1.68449318, 2.11715375, 1.46355241, 1.6632504 ,
        1.49503433])}

In [100]:
df=pd.DataFrame(data) #Creating DataFrame

In [101]:
df

   States  year       pop
0    Ohio  2000  2.320122
1    Ohio  2001  1.684493
2    Ohio  2002  2.117154
3  Nevada  2000  1.463552
4  Nevada  2001  1.663250
5  Nevada  2002  1.495034

In [103]:
df.head() #displays the top 5 results

   States  year       pop
0    Ohio  2000  2.320122
1    Ohio  2001  1.684493
2    Ohio  2002  2.117154
3  Nevada  2000  1.463552
4  Nevada  2001  1.663250

In [104]:
df.head(3)

  States  year       pop
0   Ohio  2000  2.320122
1   Ohio  2001  1.684493
2   Ohio  2002  2.117154

In [105]:
df.tail() #opposite to head, it displays last 5

   States  year       pop
1    Ohio  2001  1.684493
2    Ohio  2002  2.117154
3  Nevada  2000  1.463552
4  Nevada  2001  1.663250
5  Nevada  2002  1.495034

In [106]:
df.tail(3)

   States  year       pop
3  Nevada  2000  1.463552
4  Nevada  2001  1.663250
5  Nevada  2002  1.495034

- you can also specify columns order

In [109]:
df2=pd.DataFrame(df,columns=['year','States','pop'])

In [110]:
df2

   year  States       pop
0  2000    Ohio  2.320122
1  2001    Ohio  1.684493
2  2002    Ohio  2.117154
3  2000  Nevada  1.463552
4  2001  Nevada  1.663250
5  2002  Nevada  1.495034

- Passing the columns index in the DataFrame, that isn't in the DataFrame

In [133]:
df3=pd.DataFrame(df,columns=['year','States','pop','dept'])

In [134]:
df3

   year  States       pop  dept
0  2000    Ohio  2.320122   NaN
1  2001    Ohio  1.684493   NaN
2  2002    Ohio  2.117154   NaN
3  2000  Nevada  1.463552   NaN
4  2001  Nevada  1.663250   NaN
5  2002  Nevada  1.495034   NaN

In [135]:
df3.columns

Index(['year', 'States', 'pop', 'dept'], dtype='object')

In [136]:
df3['States']

0      Ohio
1      Ohio
2      Ohio
3    Nevada
4    Nevada
5    Nevada
Name: States, dtype: object

- you can get values with respect to it's  index location

In [144]:
df3.index=['one','two','three','four','five','six']

In [147]:
df3

       year  States       pop  dept
one    2000    Ohio  2.320122   NaN
two    2001    Ohio  1.684493   NaN
three  2002    Ohio  2.117154   NaN
four   2000  Nevada  1.463552   NaN
five   2001  Nevada  1.663250   NaN
six    2002  Nevada  1.495034   NaN

In [146]:
df3.loc['three']

year         2002
States       Ohio
pop       2.11715
dept          NaN
Name: three, dtype: object

In [148]:
df3.loc['four']

year         2000
States     Nevada
pop       1.46355
dept          NaN
Name: four, dtype: object

- Adding value into the Dept Column

In [149]:
df3['dept']=421.42

In [150]:
df3

       year  States       pop    dept
one    2000    Ohio  2.320122  421.42
two    2001    Ohio  1.684493  421.42
three  2002    Ohio  2.117154  421.42
four   2000  Nevada  1.463552  421.42
five   2001  Nevada  1.663250  421.42
six    2002  Nevada  1.495034  421.42

In [153]:
df3['dept']=np.random.rand(6)+2.2

In [154]:
df3

       year  States       pop      dept
one    2000    Ohio  2.320122  3.194006
two    2001    Ohio  1.684493  2.981835
three  2002    Ohio  2.117154  2.924014
four   2000  Nevada  1.463552  2.833651
five   2001  Nevada  1.663250  2.497700
six    2002  Nevada  1.495034  3.054418

#### What will happen if we add values of different length to a column

In [166]:
ser=pd.Series([44.4,-42.1,24.1],index=['a','b','c'])

In [167]:
ser

a    44.4
b   -42.1
c    24.1
dtype: float64

In [168]:
df3

       year  States       pop      dept
one    2000    Ohio  2.320122  3.194006
two    2001    Ohio  1.684493  2.981835
three  2002    Ohio  2.117154  2.924014
four   2000  Nevada  1.463552  2.833651
five   2001  Nevada  1.663250  2.497700
six    2002  Nevada  1.495034  3.054418

ser and df3[dept] are of different length

In [169]:
df3['dept']=ser

In [171]:
df3 
#values are not added, because of different index values

       year  States       pop  dept
one    2000    Ohio  2.320122   NaN
two    2001    Ohio  1.684493   NaN
three  2002    Ohio  2.117154   NaN
four   2000  Nevada  1.463552   NaN
five   2001  Nevada  1.663250   NaN
six    2002  Nevada  1.495034   NaN

In [173]:
ser=pd.Series([44.4,-42.1,24.1],index=['one','three','six'])
ser

one      44.4
three   -42.1
six      24.1
dtype: float64

In [174]:
df3['dept']=ser

In [176]:
df3
#after adding ser of length 3 to dept column of df3 table of length 6, so 6-3=3 values became NaN,

       year  States       pop  dept
one    2000    Ohio  2.320122  44.4
two    2001    Ohio  1.684493   NaN
three  2002    Ohio  2.117154 -42.1
four   2000  Nevada  1.463552   NaN
five   2001  Nevada  1.663250   NaN
six    2002  Nevada  1.495034  24.1

- You can also add another column, while applying some logic

In [177]:
df3['Eastern']=df3.States=='Ohio'

In [178]:
df3

       year  States       pop  dept  Eastern
one    2000    Ohio  2.320122  44.4     True
two    2001    Ohio  1.684493   NaN     True
three  2002    Ohio  2.117154 -42.1     True
four   2000  Nevada  1.463552   NaN    False
five   2001  Nevada  1.663250   NaN    False
six    2002  Nevada  1.495034  24.1    False

#### NESTED DICTIONARY

In [179]:
pop= {'NEVADA':{2001:2.4,2002:2.9},
'Ohio':{2000:1.5,2001:1.7,2002:3.6} }

In [180]:
pop

{'NEVADA': {2001: 2.4, 2002: 2.9}, 'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}

In [181]:
frame3=pd.DataFrame(pop)

In [183]:
frame3 
#here, the outer keys becomes column and the inner keys have became the index/row keys

      NEVADA  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [184]:
pop= {'NEVADA':{3001:2.4,1002:2.9},
'Ohio':{2000:1.5,2001:1.7,2002:3.6} }

In [185]:
frame=pd.DataFrame(pop)

In [186]:
frame

      NEVADA  Ohio
1002     2.9   NaN
2000     NaN   1.5
2001     NaN   1.7
2002     NaN   3.6
3001     2.4   NaN

### Trasposing the DataFrame

In [187]:
frame.T

        1002  2000  2001  2002  3001
NEVADA   2.9   NaN   NaN   NaN   2.4
Ohio     NaN   1.5   1.7   3.6   NaN

- Sorting the DataFrame through the index values

In [188]:
frame

      NEVADA  Ohio
1002     2.9   NaN
2000     NaN   1.5
2001     NaN   1.7
2002     NaN   3.6
3001     2.4   NaN

In [189]:
pd.DataFrame(frame,index=[2000,2002,3001])

      NEVADA  Ohio
2000     NaN   1.5
2002     NaN   3.6
3001     2.4   NaN

In [191]:
pdata={'Ohio':frame['Ohio'][:-1],
        'Nevada':frame['NEVADA'][1:]  } #another way to create a dataFrame

In [193]:
pd.DataFrame(pdata)

      Ohio  Nevada
1002   NaN     NaN
2000   1.5     NaN
2001   1.7     NaN
2002   3.6     NaN
3001   NaN     2.4